STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_ddr.c
/**
  ******************************************************************************
  * @file    stm32mp1xx_hal_ddr.c
  * @author  MCD Application Team
  * @brief   DDR HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Double Data Rate Synchronous Dynamic Random
  *          Access Memory (DDR-SDRAM) Peripheral, through its controller
  *          (DDRCTRL) and its physical interface controller (DDRPHYC).
  *           +
  *           +
  *           +
  *
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
 ===============================================================================
                        ##### How to use this driver #####
 ===============================================================================

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp1xx_hal.h"

#ifdef HAL_DDR_MODULE_ENABLED

#include <errno.h>
#include <stdbool.h>
#ifdef DDR_INTERACTIVE
#include <stdlib.h>
#include <ctype.h>
#endif
#include <string.h>

#ifdef DDR_INTERACTIVE
  #include "stm32mp_cubemx_conf.h"
  #include "stm32mp_cubemx_ddr_conf.h"
#else /* DDR_INTERACTIVE */
#if defined DDR_TYPE_DDR3_4Gb
      #include "stm32mp1xx-ddr3-4Gb.h"
#elif defined DDR_TYPE_DDR3_8Gb
    #include "stm32mp1xx-ddr3-8Gb.h"
#elif defined DDR_TYPE_LPDDR2_4Gb
    #error "Mismatch between driver generation and DDR_TYPE."
#elif defined DDR_TYPE_LPDDR3_4Gb
    #error "Mismatch between driver generation and DDR_TYPE."
#else
  #error "no DDR settings defined."
  #error "Please make sure that DDR_TYPE is set within those values:"
  #error "  DDR_TYPE_DDR3_4Gb"
  #error "  DDR_TYPE_DDR3_8Gb"
  #error "  DDR_TYPE_LPDDR2_4Gb"
  #error "  DDR_TYPE_LPDDR3_4Gb"
  #error "Please refer to your HW platform capabilities."
#endif
#endif /* DDR_INTERACTIVE */

/** @addtogroup STM32MP1xx_HAL_Driver
  * @{
  */

/** @defgroup DDR DDR
  * @brief HAL DDR module driver
  * @{
  */
#if defined (DDRCTRL) && defined (DDRPHYC)

/* Private typedef -----------------------------------------------------------*/

typedef struct {
  const char *name;
  uint16_t offset; /* Offset for base address */
  uint8_t par_offset; /* Offset for parameter array */
}reg_desc;

typedef enum {
  BASE_DDRCTRL,
  BASE_DDRPHYC,
  BASE_NONE
} base_type;

typedef struct {
  const char *name;
  const reg_desc *desc;
  uint8_t size;
  base_type base;
}ddr_reg_info;

typedef enum {
  REG_REG,
  REG_TIMING,
  REG_PERF,
  REG_MAP,
  REGPHY_REG,
  REGPHY_TIMING,
#ifdef DDR_INTERACTIVE
/* dynamic registers => managed in driver or not changed,
 * can be dumped in interactive mode
 */
  REG_DYN,
  REGPHY_DYN,
#endif
  REG_TYPE_NB
}reg_type;

/* Private define ------------------------------------------------------------*/
/** @defgroup DDR_Private_Constants DDR Private Constants
  * @{
  */
#define INVALID_OFFSET 0xFFU

#define DDRCTL_REG(x, y) \
  { \
    .name = #x, \
    .offset = offsetof(DDRCTRL_TypeDef, x), \
    .par_offset = offsetof(y, x) \
  }

#define DDRPHY_REG(x, y) \
  { \
    .name = #x, \
    .offset = offsetof(DDRPHYC_TypeDef, x), \
    .par_offset = offsetof(y, x) \
  }

#ifdef DDR_INTERACTIVE
#define DDRCTL_REG_DYN(x) \
  { \
    .name =#x, \
    .offset = offsetof(DDRCTRL_TypeDef, x), \
    .par_offset = INVALID_OFFSET \
  }

#define DDRPHY_REG_DYN(x) \
  { \
    .name = #x,\
    .offset = offsetof( DDRPHYC_TypeDef, x),\
    .par_offset = INVALID_OFFSET \
  }
#endif /* DDR_INTERACTIVE */

#define DDRCTL_REG_REG(x) DDRCTL_REG(x, HAL_DDR_RegTypeDef)
static const reg_desc ddr_reg_desc[] = {
  DDRCTL_REG_REG(MSTR),
  DDRCTL_REG_REG(MRCTRL0),
  DDRCTL_REG_REG(MRCTRL1),
  DDRCTL_REG_REG(DERATEEN),
  DDRCTL_REG_REG(DERATEINT),
  DDRCTL_REG_REG(PWRCTL),
  DDRCTL_REG_REG(PWRTMG),
  DDRCTL_REG_REG(HWLPCTL),
  DDRCTL_REG_REG(RFSHCTL0),
  DDRCTL_REG_REG(RFSHCTL3),
  DDRCTL_REG_REG(CRCPARCTL0),
  DDRCTL_REG_REG(ZQCTL0),
  DDRCTL_REG_REG(DFITMG0),
  DDRCTL_REG_REG(DFITMG1),
  DDRCTL_REG_REG(DFILPCFG0),
  DDRCTL_REG_REG(DFIUPD0),
  DDRCTL_REG_REG(DFIUPD1),
  DDRCTL_REG_REG(DFIUPD2),
  DDRCTL_REG_REG(DFIPHYMSTR),
  DDRCTL_REG_REG(ODTMAP),
  DDRCTL_REG_REG(DBG0),
  DDRCTL_REG_REG(DBG1),
  DDRCTL_REG_REG(DBGCMD),
  DDRCTL_REG_REG(POISONCFG),
  DDRCTL_REG_REG(PCCFG),
};

#define DDRCTL_REG_TIMING(x) DDRCTL_REG(x, HAL_DDR_TimingTypeDef)
static const reg_desc ddr_timing_desc[] = {
  DDRCTL_REG_TIMING(RFSHTMG),
  DDRCTL_REG_TIMING(DRAMTMG0),
  DDRCTL_REG_TIMING(DRAMTMG1),
  DDRCTL_REG_TIMING(DRAMTMG2),
  DDRCTL_REG_TIMING(DRAMTMG3),
  DDRCTL_REG_TIMING(DRAMTMG4),
  DDRCTL_REG_TIMING(DRAMTMG5),
  DDRCTL_REG_TIMING(DRAMTMG6),
  DDRCTL_REG_TIMING(DRAMTMG7),
  DDRCTL_REG_TIMING(DRAMTMG8),
  DDRCTL_REG_TIMING(DRAMTMG14),
  DDRCTL_REG_TIMING(ODTCFG),
};

#define DDRCTL_REG_MAP(x) DDRCTL_REG(x, HAL_DDR_MapTypeDef)
static const reg_desc ddr_map_desc[] = {
  DDRCTL_REG_MAP(ADDRMAP1),
  DDRCTL_REG_MAP(ADDRMAP2),
  DDRCTL_REG_MAP(ADDRMAP3),
  DDRCTL_REG_MAP(ADDRMAP4),
  DDRCTL_REG_MAP(ADDRMAP5),
  DDRCTL_REG_MAP(ADDRMAP6),
  DDRCTL_REG_MAP(ADDRMAP9),
  DDRCTL_REG_MAP(ADDRMAP10),
  DDRCTL_REG_MAP(ADDRMAP11),
};

#define DDRCTL_REG_PERF(x) DDRCTL_REG(x, HAL_DDR_PerfTypeDef)
static const reg_desc ddr_perf_desc[] = {
  DDRCTL_REG_PERF(SCHED),
  DDRCTL_REG_PERF(SCHED1),
  DDRCTL_REG_PERF(PERFHPR1),
  DDRCTL_REG_PERF(PERFLPR1),
  DDRCTL_REG_PERF(PERFWR1),
  DDRCTL_REG_PERF(PCFGR_0),
  DDRCTL_REG_PERF(PCFGW_0),
  DDRCTL_REG_PERF(PCFGQOS0_0),
  DDRCTL_REG_PERF(PCFGQOS1_0),
  DDRCTL_REG_PERF(PCFGWQOS0_0),
  DDRCTL_REG_PERF(PCFGWQOS1_0),
#ifdef DDR_DUAL_AXI_PORT
  DDRCTL_REG_PERF(PCFGR_1),
  DDRCTL_REG_PERF(PCFGW_1),
  DDRCTL_REG_PERF(PCFGQOS0_1),
  DDRCTL_REG_PERF(PCFGQOS1_1),
  DDRCTL_REG_PERF(PCFGWQOS0_1),
  DDRCTL_REG_PERF(PCFGWQOS1_1),
#endif
};

