STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_ddr.c
#define DDRPHY_REG_REG(x) DDRPHY_REG(x, HAL_DDR_PhyRegTypeDef)
static const reg_desc ddrphy_reg_desc[] = {
  DDRPHY_REG_REG(PGCR),
  DDRPHY_REG_REG(ACIOCR),
  DDRPHY_REG_REG(DXCCR),
  DDRPHY_REG_REG(DSGCR),
  DDRPHY_REG_REG(DCR),
  DDRPHY_REG_REG(ODTCR),
  DDRPHY_REG_REG(ZQ0CR1),
  DDRPHY_REG_REG(DX0GCR),
  DDRPHY_REG_REG(DX1GCR),
#ifdef DDR_32BIT_INTERFACE
  DDRPHY_REG_REG(DX2GCR),
  DDRPHY_REG_REG(DX3GCR),
#endif
};

#define DDRPHY_REG_TIMING(x) DDRPHY_REG(x, HAL_DDR_PhyTimingTypeDef)
static const reg_desc ddrphy_timing_desc[] = {
  DDRPHY_REG_TIMING(PTR0),
  DDRPHY_REG_TIMING(PTR1),
  DDRPHY_REG_TIMING(PTR2),
  DDRPHY_REG_TIMING(DTPR0),
  DDRPHY_REG_TIMING(DTPR1),
  DDRPHY_REG_TIMING(DTPR2),
  DDRPHY_REG_TIMING(MR0),
  DDRPHY_REG_TIMING(MR1),
  DDRPHY_REG_TIMING(MR2),
  DDRPHY_REG_TIMING(MR3),
};

#ifdef DDR_INTERACTIVE
/*******************************************************************
 * DYNAMIC REGISTERS: only used for interactive mode (read/modify)
 *******************************************************************/
static const reg_desc ddr_dyn_desc[] = {
  DDRCTL_REG_DYN(STAT),
  DDRCTL_REG_DYN(INIT0),
  DDRCTL_REG_DYN(DFIMISC),
  DDRCTL_REG_DYN(DFISTAT),
  DDRCTL_REG_DYN(SWCTL),
  DDRCTL_REG_DYN(SWSTAT),
  DDRCTL_REG_DYN(PCTRL_0),
#ifdef DDR_DUAL_AXI_PORT
  DDRCTL_REG_DYN(PCTRL_1),
#endif
};

#define DDRCTL_REG_DYN_SIZE ARRAY_SIZE(ddr_dyn)

static const reg_desc ddrphy_dyn_desc[] = {
  DDRPHY_REG_DYN(PIR),
  DDRPHY_REG_DYN(PGSR),
  DDRPHY_REG_DYN(ZQ0SR0),
  DDRPHY_REG_DYN(ZQ0SR1),
  DDRPHY_REG_DYN(DX0GSR0),
  DDRPHY_REG_DYN(DX0GSR1),
  DDRPHY_REG_DYN(DX0DLLCR),
  DDRPHY_REG_DYN(DX0DQTR),
  DDRPHY_REG_DYN(DX0DQSTR),
  DDRPHY_REG_DYN(DX1GSR0),
  DDRPHY_REG_DYN(DX1GSR1),
  DDRPHY_REG_DYN(DX1DLLCR),
  DDRPHY_REG_DYN(DX1DQTR),
  DDRPHY_REG_DYN(DX1DQSTR),
#ifdef DDR_32BIT_INTERFACE
  DDRPHY_REG_DYN(DX2GSR0),
  DDRPHY_REG_DYN(DX2GSR1),
  DDRPHY_REG_DYN(DX2DLLCR),
  DDRPHY_REG_DYN(DX2DQTR),
  DDRPHY_REG_DYN(DX2DQSTR),
  DDRPHY_REG_DYN(DX3GSR0),
  DDRPHY_REG_DYN(DX3GSR1),
  DDRPHY_REG_DYN(DX3DLLCR),
  DDRPHY_REG_DYN(DX3DQTR),
  DDRPHY_REG_DYN(DX3DQSTR),
#endif
};

#define DDRPHY_REG_DYN_SIZE ARRAY_SIZE(ddrphy_dyn)
#endif /* DDR_INTERACTIVE */

#define ARRAY_SIZE(a) (sizeof(a) / sizeof((a)[0]))
static const ddr_reg_info ddr_registers[REG_TYPE_NB] = {
  [REG_REG] = {
    .name = "static",
    .desc = ddr_reg_desc,
    .size = ARRAY_SIZE(ddr_reg_desc),
    .base = BASE_DDRCTRL
  },
  [REG_TIMING] = {
    .name = "timing",
    .desc = ddr_timing_desc,
    .size = ARRAY_SIZE(ddr_timing_desc),
    .base = BASE_DDRCTRL
  },
  [REG_PERF] = {
    .name = "perf",
    .desc = ddr_perf_desc,
    .size = ARRAY_SIZE(ddr_perf_desc),
    .base = BASE_DDRCTRL
  },
  [REG_MAP] = {
    .name = "map",
    .desc = ddr_map_desc,
    .size = ARRAY_SIZE(ddr_map_desc),
    .base = BASE_DDRCTRL
  },
  [REGPHY_REG] = {
    .name = "static",
    .desc = ddrphy_reg_desc,
    .size = ARRAY_SIZE(ddrphy_reg_desc),
    .base = BASE_DDRPHYC
  },
  [REGPHY_TIMING] = {
    .name = "timing",
    .desc = ddrphy_timing_desc,
    .size = ARRAY_SIZE(ddrphy_timing_desc),
    .base = BASE_DDRPHYC
  },
#ifdef DDR_INTERACTIVE
  [REG_DYN] = {
    .name = "dyn",
    .desc = ddr_dyn_desc,
    .size = ARRAY_SIZE(ddr_dyn_desc),
    .base = BASE_DDRCTRL
  },
  [REGPHY_DYN] = {
    .name = "dyn",
    .desc = ddrphy_dyn_desc,
    .size = ARRAY_SIZE(ddrphy_dyn_desc),
    .base = BASE_DDRPHYC
  },
#endif /* DDR_INTERACTIVE */
};

const char *base_name[] = {
  [BASE_DDRCTRL] = "ctl",
  [BASE_DDRPHYC] = "phy",
};

#define DDR_DELAY_1_US                       1
#define DDR_TIMEOUT_1_US                     1
#define DDR_DELAY_2_US                       2 * DDR_DELAY_1_US
#define DDR_DELAY_10_US                      10 * DDR_DELAY_1_US
#define DDR_DELAY_END_LOGIC_INIT_US          DDR_DELAY_2_US
#define DDR_DELAY_PHY_INIT_US                DDR_DELAY_10_US
#define DDR_TIMEOUT_10_US                    10 * DDR_TIMEOUT_1_US
#define DDR_TIMEOUT_50_US                    50 * DDR_TIMEOUT_1_US
#define DDR_TIMEOUT_500_US                   500 * DDR_TIMEOUT_1_US
#define DDR_TIMEOUT_200_MS                   200000 * DDR_TIMEOUT_1_US
#define DDR_TIMEOUT_1S                       1000000 * DDR_TIMEOUT_1_US

#define TIMESLOT_1US                         (__get_CNTFRQ() / 1000000)

#define DDRCTRL_MSTR_DATA_BUS_WIDTH_HALF     DDRCTRL_MSTR_DATA_BUS_WIDTH_0
#define DDRCTRL_MSTR_DATA_BUS_WIDTH_QUARTER  DDRCTRL_MSTR_DATA_BUS_WIDTH_1
#define DDRCTRL_STAT_OPERATING_MODE_SR       (DDRCTRL_STAT_OPERATING_MODE_0 | \
                                              DDRCTRL_STAT_OPERATING_MODE_1)
#define DDRCTRL_STAT_OPERATING_MODE_NORMAL   DDRCTRL_STAT_OPERATING_MODE_0
#define DDRCTRL_STAT_SELFREF_TYPE_ASR        (DDRCTRL_STAT_SELFREF_TYPE_0 | \
                                              DDRCTRL_STAT_SELFREF_TYPE_1)
#define DDRCTRL_STAT_SELFREF_TYPE_SR         DDRCTRL_STAT_SELFREF_TYPE_1
#define DDRCTRL_MRCTRL0_MR_TYPE_WRITE        0
#define DDRCTRL_MRCTRL0_MR_TYPE_READ         DDRCTRL_MRCTRL0_MR_TYPE
#define DDRCTRL_MRCTRL0_MR_RANK_ALL          DDRCTRL_MRCTRL0_MR_RANK
#define DDRCTRL_INIT0_SKIP_DRAM_INIT_NORMAL  DDRCTRL_INIT0_SKIP_DRAM_INIT_0
#define DDRCTRL_DBGCAM_DATA_PIPELINE_EMPTY \
                                      (DDRCTRL_DBGCAM_WR_DATA_PIPELINE_EMPTY | \
                                       DDRCTRL_DBGCAM_RD_DATA_PIPELINE_EMPTY)
#define DDRCTRL_DBG_Q_AND_DATA_PIPELINE_EMPTY \
                                            (DDRCTRL_DBGCAM_DBG_WR_Q_EMPTY | \
                                             DDRCTRL_DBGCAM_DBG_RD_Q_EMPTY | \
                                             DDRCTRL_DBGCAM_DATA_PIPELINE_EMPTY)
#define DDRCTRL_DBGCAM_DBG_Q_DEPTH           (DDRCTRL_DBGCAM_DBG_WR_Q_EMPTY | \
                                              DDRCTRL_DBGCAM_DBG_LPR_Q_DEPTH | \
                                              DDRCTRL_DBGCAM_DBG_HPR_Q_DEPTH)

#define DDR_BASE_ADDR                        0xC0000000
#define DDR_MAX_SIZE                         0x40000000
#define DDR_PATTERN                          0xAAAAAAAAU
#define DDR_ANTIPATTERN                      0x55555555U
#define DDR_TRAINING_AREA_SIZE               64

#define RCC_DDRITFCR_DDRCKMOD_ASR1           RCC_DDRITFCR_DDRCKMOD_0
#define RCC_DDRITFCR_DDRCKMOD_HSR1           RCC_DDRITFCR_DDRCKMOD_1

