STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_ddr.c
#define BKPRAM_ZDATA_OFFSET                  0

#define SCTLR_C_BIT                          (1U << 2)
/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

HAL_DDR_ConfigTypeDef static_ddr_config = {
  .info = {
    .name = DDR_MEM_NAME,
    .speed = DDR_MEM_SPEED,
    .size = DDR_MEM_SIZE
  },

  .c_reg = {
    .MSTR = DDR_MSTR,
    .MRCTRL0 = DDR_MRCTRL0,
    .MRCTRL1 = DDR_MRCTRL1,
    .DERATEEN = DDR_DERATEEN,
    .DERATEINT = DDR_DERATEINT,
    .PWRCTL = DDR_PWRCTL,
    .PWRTMG = DDR_PWRTMG,
    .HWLPCTL = DDR_HWLPCTL,
    .RFSHCTL0 = DDR_RFSHCTL0,
    .RFSHCTL3 = DDR_RFSHCTL3,
    .CRCPARCTL0 = DDR_CRCPARCTL0,
    .ZQCTL0 = DDR_ZQCTL0,
    .DFITMG0 = DDR_DFITMG0,
    .DFITMG1 = DDR_DFITMG1,
    .DFILPCFG0 = DDR_DFILPCFG0,
    .DFIUPD0 = DDR_DFIUPD0,
    .DFIUPD1 = DDR_DFIUPD1,
    .DFIUPD2 = DDR_DFIUPD2,
    .DFIPHYMSTR = DDR_DFIPHYMSTR,
    .ODTMAP = DDR_ODTMAP,
    .DBG0 = DDR_DBG0,
    .DBG1 = DDR_DBG1,
    .DBGCMD = DDR_DBGCMD,
    .POISONCFG = DDR_POISONCFG,
    .PCCFG = DDR_PCCFG
  },

  .c_timing = {
    .RFSHTMG = DDR_RFSHTMG,
    .DRAMTMG0 = DDR_DRAMTMG0,
    .DRAMTMG1 = DDR_DRAMTMG1,
    .DRAMTMG2 = DDR_DRAMTMG2,
    .DRAMTMG3 = DDR_DRAMTMG3,
    .DRAMTMG4 = DDR_DRAMTMG4,
    .DRAMTMG5 = DDR_DRAMTMG5,
    .DRAMTMG6 = DDR_DRAMTMG6,
    .DRAMTMG7 = DDR_DRAMTMG7,
    .DRAMTMG8 = DDR_DRAMTMG8,
    .DRAMTMG14 = DDR_DRAMTMG14,
    .ODTCFG = DDR_ODTCFG
  },


  .c_map = {
    .ADDRMAP1 = DDR_ADDRMAP1,
    .ADDRMAP2 = DDR_ADDRMAP2,
    .ADDRMAP3 = DDR_ADDRMAP3,
    .ADDRMAP4 = DDR_ADDRMAP4,
    .ADDRMAP5 = DDR_ADDRMAP5,
    .ADDRMAP6 = DDR_ADDRMAP6,
    .ADDRMAP9 = DDR_ADDRMAP9,
    .ADDRMAP10 = DDR_ADDRMAP10,
    .ADDRMAP11 = DDR_ADDRMAP11
  },

  .c_perf = {
    .SCHED = DDR_SCHED,
    .SCHED1 = DDR_SCHED1,
    .PERFHPR1 = DDR_PERFHPR1,
    .PERFLPR1 = DDR_PERFLPR1,
    .PERFWR1 = DDR_PERFWR1,
    .PCFGR_0 = DDR_PCFGR_0,
    .PCFGW_0 = DDR_PCFGW_0,
    .PCFGQOS0_0 = DDR_PCFGQOS0_0,
    .PCFGQOS1_0 = DDR_PCFGQOS1_0,
    .PCFGWQOS0_0 = DDR_PCFGWQOS0_0,
    .PCFGWQOS1_0 = DDR_PCFGWQOS1_0,
#ifdef DDR_DUAL_AXI_PORT
    .PCFGR_1 = DDR_PCFGR_1,
    .PCFGW_1 = DDR_PCFGW_1,
    .PCFGQOS0_1 = DDR_PCFGQOS0_1,
    .PCFGQOS1_1 = DDR_PCFGQOS1_1,
    .PCFGWQOS0_1 = DDR_PCFGWQOS0_1,
    .PCFGWQOS1_1 = DDR_PCFGWQOS1_1
#endif
  },

  .p_reg = {
    .PGCR = DDR_PGCR,
    .ACIOCR = DDR_ACIOCR,
    .DXCCR = DDR_DXCCR,
    .DSGCR = DDR_DSGCR,
    .DCR = DDR_DCR,
    .ODTCR = DDR_ODTCR,
    .ZQ0CR1 = DDR_ZQ0CR1,
    .DX0GCR = DDR_DX0GCR,
    .DX1GCR = DDR_DX1GCR,
#ifdef DDR_32BIT_INTERFACE
    .DX2GCR = DDR_DX2GCR,
    .DX3GCR = DDR_DX3GCR
#endif
  },

  .p_timing = {
    .PTR0 = DDR_PTR0,
    .PTR1 = DDR_PTR1,
    .PTR2 = DDR_PTR2,
    .DTPR0 = DDR_DTPR0,
    .DTPR1 = DDR_DTPR1,
    .DTPR2 = DDR_DTPR2,
    .MR0 = DDR_MR0,
    .MR1 = DDR_MR1,
    .MR2 = DDR_MR2,
    .MR3 = DDR_MR3
  }
};

/* Private function prototypes -----------------------------------------------*/
/** @defgroup DDR_Private_Functions DDR Private Functions
  * @{
  */

static void ddr_delay_us(unsigned long delay_us)
{
  __IO uint32_t wait_loop_index = 0U;

  wait_loop_index = (delay_us * (SystemCoreClock / (1000000UL * 2UL)));


  while(wait_loop_index != 0UL)
  {
    wait_loop_index--;
  }
}

static __IO uint32_t ddr_timeout_init_us(unsigned long timeout_us)
{
  __IO uint32_t wait_loop_index = 0U;

  wait_loop_index = timeout_us * (SystemCoreClock / (1000000UL * 2UL));


  return wait_loop_index;
}

static bool ddr_timeout_elapsed(__IO uint32_t timeout)
{
  if (timeout == 0U)
  {
    return true;
  }

  return false;
}

#ifndef DDR_INTERACTIVE
static void __attribute__ ((unused)) save_ddr_training_area(void)
{
  SET_BIT(RCC->MP_AHB5ENSETR, RCC_MP_AHB5ENSETR_BKPSRAMEN);

  memcpy(( uint32_t*)BKPSRAM_BASE , (uint32_t *)DDR_BASE_ADDR,
         DDR_TRAINING_AREA_SIZE);

  __DSB();

  CLEAR_BIT(RCC->MP_AHB5ENSETR, RCC_MP_AHB5ENSETR_BKPSRAMEN);
}
#endif /* !DDR_INTERACTIVE */

static void restore_ddr_training_area(void)
{
  SET_BIT(RCC->MP_AHB5ENSETR, RCC_MP_AHB5ENSETR_BKPSRAMEN);

  memcpy((uint32_t *)DDR_BASE_ADDR, ( uint32_t*)BKPSRAM_BASE ,
         DDR_TRAINING_AREA_SIZE);

  __DSB();

  CLEAR_BIT(RCC->MP_AHB5ENSETR, RCC_MP_AHB5ENSETR_BKPSRAMEN);
}

/* board-specific DDR power initializations. */
__weak int HAL_DDR_MspInit(ddr_type type)
{
  return 0;
}

static void ddr_enable_clock(void)
{
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC1EN
#ifdef DDR_DUAL_AXI_PORT
                         | RCC_DDRITFCR_DDRC2EN
#endif
                         | RCC_DDRITFCR_DDRPHYCEN
                         | RCC_DDRITFCR_DDRPHYCAPBEN
                         | RCC_DDRITFCR_DDRCAPBEN);
}

static int ddr_clk_enable(uint32_t mem_speed)
{
  unsigned long ddrphy_clk, ddr_clk, mem_speed_hz;
  PLL2_ClocksTypeDef PLL2;

  ddr_enable_clock();

  HAL_RCC_GetPLL2ClockFreq(&PLL2);
  ddrphy_clk = PLL2.PLL2_R_Frequency;

  mem_speed_hz = mem_speed * 1000U;

  /* Max 10% frequency delta */
  if (ddrphy_clk > mem_speed_hz)
  {
    ddr_clk = ddrphy_clk - mem_speed_hz;
  }
  else
  {
    ddr_clk = mem_speed_hz - ddrphy_clk;
  }

  if (ddr_clk > (mem_speed_hz / 10))
  {
    return -1;
  }

  return 0;
}

static uint32_t get_base_addr(base_type base)
{
  if (base == BASE_DDRPHYC)
  {
    return (uint32_t)DDRPHYC_BASE;
  }
  else
  {
    return (uint32_t)DDRCTRL_BASE;
  }
}

static HAL_StatusTypeDef set_reg(reg_type type, const void *param)
{
  unsigned int i;
  uint32_t value;
  uint32_t base_addr = get_base_addr(ddr_registers[type].base);
  const reg_desc *desc = ddr_registers[type].desc;

  for (i = 0; i < ddr_registers[type].size; i++)
  {
    if (desc[i].par_offset == INVALID_OFFSET)
    {
      return HAL_ERROR;
    }
    else
    {
      value = *((uint32_t *)((uintptr_t)param + desc[i].par_offset));
      WRITE_REG(*(volatile uint32_t*)(base_addr + desc[i].offset), value);
    }
  }

  return HAL_OK;
}

#ifdef DDR_INTERACTIVE
HAL_StatusTypeDef HAL_DDR_ASS_Set_Clksrc(uint32_t clksrc)
{
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_200_MS);

  /* Set AXI Sub-System Clock Source */
  MODIFY_REG(RCC->ASSCKSELR, (RCC_ASSCKSELR_AXISSRC), clksrc);

