STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_ddr.c
  while ((RCC->ASSCKSELR & RCC_ASSCKSELR_AXISSRCRDY_Msk) != RCC_ASSCKSELR_AXISSRCRDY )
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT; /* Timeout setting clock source */
    }
  }

  return HAL_OK;
}

void HAL_DDR_Convert_Case(const char *in_str, char *out_str, bool ToUpper)
{
  while((*out_str = ToUpper? toupper(*in_str) : tolower(*in_str)))
  {
    in_str++;
    out_str++;
  }

  return;
}

static void dump_reg_desc(uint32_t base_addr, const reg_desc *desc,
                                   bool save)
{
  uint32_t ptr;
  char reg_name[strlen(desc->name)];
  char output_dest[50] = "";

  if (save)
  {
    sprintf(output_dest, "#define DDR_%s", desc->name);
  }
  else
  {
    HAL_DDR_Convert_Case(desc->name, reg_name, 0); /* convert to lower case */
    sprintf(output_dest, "%s=", reg_name);
  }

  ptr = (uint32_t)(base_addr + desc->offset);
  printf("%s 0x%08lx\n\r", output_dest, READ_REG(*(volatile uint32_t*)ptr));
}

static void dump_param_desc(uint32_t par_addr, const reg_desc *desc)
{
  uint32_t ptr;
  char reg_name[strlen(desc->name)];

  HAL_DDR_Convert_Case(desc->name, reg_name, 0); /* convert to lower case */
  ptr = (uint32_t)(par_addr + desc->par_offset);
  printf("%s= 0x%08lx\n\r", reg_name, READ_REG(*(volatile uint32_t*)ptr));
}

static const reg_desc *found_reg(const char *name, reg_type *type)
{
  unsigned int i, j;
  const reg_desc *desc;

  for (i = 0; i < ARRAY_SIZE(ddr_registers); i++)
  {
    desc = ddr_registers[i].desc;
    for (j = 0; j < ddr_registers[i].size; j++)
    {
      if (strcmp(name, desc[j].name) == 0)
      {
        *type = i;
        return &desc[j];
      }
    }
  }

  *type = REG_TYPE_NB;

  return NULL;
}

HAL_StatusTypeDef HAL_DDR_Dump_Reg(const char *name, bool save)
{
  unsigned int i, j;
  const reg_desc *desc;
  uint32_t base_addr;
  base_type p_base;
  reg_type type;
  const char *p_name;
  base_type filter = BASE_NONE;
  HAL_StatusTypeDef result = HAL_ERROR;

  if (save) {
    printf("\n/* DDR REG VALUES TO BE SAVED */\n\r");
    printf("#define DDR_MEM_NAME  \"%s\"\n\r", static_ddr_config.info.name);
    printf("#define DDR_MEM_SPEED %d\n\r", (int)static_ddr_config.info.speed);
    printf("#define DDR_MEM_SIZE  0x%08lx\n\n\r", static_ddr_config.info.size);
  }
  else
  {
    if (name) {
      if (strcmp(name, base_name[BASE_DDRCTRL]) == 0)
      {
        filter = BASE_DDRCTRL;
      }
      else if (strcmp(name, base_name[BASE_DDRPHYC]) == 0)
      {
        filter = BASE_DDRPHYC;
      }
    }
  }

  for (i = 0; i < ARRAY_SIZE(ddr_registers); i++)
  {
    p_base = ddr_registers[i].base;
    p_name = ddr_registers[i].name;
    if (!name || (filter == p_base || !strcmp(name, p_name)) || save)
    {
      result = HAL_OK;
      desc = ddr_registers[i].desc;
      base_addr = get_base_addr(p_base);

      if (save)
      {
#ifdef DDR_INTERACTIVE
        if (i == REG_DYN)
        {
          printf("\n/* /!\\ No need to copy DDR dynamic registers to conf file */\n\r");
        }
#endif
        printf("\n/* %s.%s */\n\r", base_name[p_base], p_name);
      }
      else
      {
        printf("==%s.%s==\n\r", base_name[p_base], p_name);
      }

      for (j = 0; j < ddr_registers[i].size; j++)
      {
        dump_reg_desc(base_addr, &desc[j], save);
      }
    }
  }

  if (result != HAL_OK)
  {
    desc = found_reg(name, &type);
    if (desc)
    {
      p_base = ddr_registers[type].base;
      base_addr = get_base_addr(p_base);
      dump_reg_desc(base_addr, desc, false);
      result = HAL_OK;
    }
  }

  return result;
}

void HAL_DDR_Edit_Reg(char *name, char *string)
{
  uint32_t value;
  uint32_t ptr;
  reg_type type;
  const reg_desc *desc;
  uint32_t base_addr;
  char *end_ptr;
  char reg_name[strlen(name)];

  HAL_DDR_Convert_Case(name, reg_name, 1); /* convert to upper case */

  desc = found_reg(reg_name, &type);

  if (!desc)
  {
    printf("%s not found\n\r", name);
    return;
  }

  value = (uint32_t)strtoll(string, &end_ptr, 0);
  if (end_ptr == string)
  {
    printf("invalid value %s\n\r", string);
    return;
  }

  base_addr = get_base_addr(ddr_registers[type].base);

  ptr = (uint32_t)(base_addr + desc->offset);
  WRITE_REG(*(volatile uint32_t*)ptr, value);

  printf("%s= 0x%08lx\n\r", desc->name, READ_REG(*(volatile uint32_t*)ptr));
}

static uint32_t get_par_addr(HAL_DDR_ConfigTypeDef *config, reg_type type)
{
  uint32_t par_addr = 0x0;

  switch (type)
  {
  case REG_REG:
    par_addr = (uint32_t)&config->c_reg;
    break;
  case REG_TIMING:
    par_addr = (uint32_t)&config->c_timing;
    break;
  case REG_PERF:
    par_addr = (uint32_t)&config->c_perf;
    break;
  case REG_MAP:
    par_addr = (uint32_t)&config->c_map;
    break;
  case REGPHY_REG:
    par_addr = (uint32_t)&config->p_reg;
    break;
  case REGPHY_TIMING:
    par_addr = (uint32_t)&config->p_timing;
    break;
  case REG_DYN:
  case REGPHY_DYN:
  case REG_TYPE_NB:
    par_addr = (uint32_t)NULL;
    break;
  }

  return par_addr;
}

HAL_StatusTypeDef HAL_DDR_Dump_Param(HAL_DDR_ConfigTypeDef *config,
                                     const char *name)
{
  unsigned int i, j;
  const reg_desc *desc;
  uint32_t par_addr;
  base_type p_base;
  reg_type type;
  const char *p_name;
  base_type filter = BASE_NONE;
  HAL_StatusTypeDef result = HAL_ERROR;

  if (name) {
    if (strcmp(name, base_name[BASE_DDRCTRL]) == 0)
    {
      filter = BASE_DDRCTRL;
    }
    else if (strcmp(name, base_name[BASE_DDRPHYC]) == 0)
    {
      filter = BASE_DDRPHYC;
    }
  }

  for (i = 0; i < ARRAY_SIZE(ddr_registers); i++)
  {
    par_addr = get_par_addr(config, i);
    if (!par_addr)
    {
      continue;
    }

    p_base = ddr_registers[i].base;
    p_name = ddr_registers[i].name;
    if (!name || (filter == p_base || !strcmp(name, p_name)))
    {
      result = HAL_OK;
      desc = ddr_registers[i].desc;
      printf("==%s.%s==\n\r\n\r", base_name[p_base], p_name);
      for (j = 0; j < ddr_registers[i].size; j++)
      {
        dump_param_desc(par_addr, &desc[j]);
      }
    }
  }

  if (result != HAL_OK)
  {
    desc = found_reg(name, &type);
    if (desc)
    {
      par_addr = get_par_addr(config, type);
      if (par_addr)
      {
        dump_param_desc(par_addr, desc);
        result = HAL_OK;
      }
    }
  }
  return result;
}

