STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_ddr.c
void HAL_DDR_Edit_Param(HAL_DDR_ConfigTypeDef *config, char *name,
                        char *string)
{
  uint32_t ptr;
  uint32_t value;
  reg_type type;
  const reg_desc *desc;
  uint32_t par_addr;
  char *end_ptr;

  desc = found_reg(name, &type);
  if (!desc)
  {
    printf("%s not found\n\r", name);
    return;
  }

  value = (uint32_t)strtoll(string, &end_ptr, 0);
  if (end_ptr == string)
  {
    printf("invalid value %s\n\r", string);
    return;
  }

  par_addr = get_par_addr(config, type);
  if (!par_addr) {
    printf("no parameter %s\n\r", name);
    return;
  }

  ptr = (uint32_t)(par_addr + desc->par_offset);
  WRITE_REG(*(volatile uint32_t*)ptr, value);

  {
    char reg_name[strlen(desc->name)];

    HAL_DDR_Convert_Case(desc->name, reg_name, 0); /* convert to lower case */
    printf("%s= 0x%08lx\n\r", reg_name, READ_REG(*(volatile uint32_t*)ptr));
  }
}
#endif /* DDR_INTERACTIVE */

__weak bool HAL_DDR_Interactive(HAL_DDR_InteractStepTypeDef step)
{
  return false;
}

#define INTERACTIVE(step) HAL_DDR_Interactive(step)

static HAL_StatusTypeDef ddrphy_idone_wait(void)
{
  uint32_t pgsr;
  int error = 0;
  uint32_t errormask = DDRPHYC_PGSR_DTERR | DDRPHYC_PGSR_DTIERR
                       | DDRPHYC_PGSR_DFTERR | DDRPHYC_PGSR_RVERR
                       | DDRPHYC_PGSR_RVEIRR;
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_50_US);

  do
  {
    pgsr = READ_REG(DDRPHYC->PGSR);

    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT; /* Timeout initialising DRAM */
    }

    if ((pgsr & errormask) != 0U)
    {
      error++;
    }
  }
  while (((pgsr & DDRPHYC_PGSR_IDONE) == 0U) && (error == 0));

  return HAL_OK;
}

static HAL_StatusTypeDef HAL_DDR_PHY_Init(uint32_t pir)
{
  uint32_t pir_init = pir | DDRPHYC_PIR_INIT;

  WRITE_REG(DDRPHYC->PIR, pir_init);

  /* Need to wait 10 configuration clock before start polling */
  ddr_delay_us(DDR_DELAY_PHY_INIT_US);

  /* Wait DRAM initialization and Gate Training Evaluation complete */
  return ddrphy_idone_wait();
}

static HAL_StatusTypeDef self_refresh_zcal(uint32_t zdata)
{
  /* sequence for PUBL I/O Data Retention during Power-Down */

  /* 10. Override ZQ calibration with previously (pre-retention)
   *     calibrated values. This is done by writing 1 to ZQ0CRN.ZDEN
   *     and the override data to ZQ0CRN.ZDATA.
   */
  SET_BIT(DDRPHYC->ZQ0CR0, DDRPHYC_ZQ0CR0_ZDEN);

  MODIFY_REG(DDRPHYC->ZQ0CR0,
             DDRPHYC_ZQ0CR0_ZDATA_Msk,
             zdata << DDRPHYC_ZQ0CR0_ZDATA_Pos);

  /* 11. De-assert the PHY_top data retention enable signals
   *     (ret_en or ret_en_i/ret_en_n_i).
   */
  SET_BIT(PWR->CR3, PWR_CR3_DDRSRDIS);
  CLEAR_BIT(PWR->CR3, PWR_CR3_DDRRETEN);

  /* 12. Remove ZQ calibration override by writing 0 to ZQ0CRN.ZDEN. */
  CLEAR_BIT(DDRPHYC->ZQ0CR0, DDRPHYC_ZQ0CR0_ZDEN);

  /* 13. Trigger ZQ calibration by writing 1 to PIR.INIT
   *     and '1' to PIR.ZCAL
   */
  /* 14. Wait for ZQ calibration to finish by polling a 1 status
   * on PGSR.IDONE.
   */
  return HAL_DDR_PHY_Init(DDRPHYC_PIR_ZCAL);
}

/* Start quasi dynamic register update */
static void start_sw_done(void)
{
  CLEAR_BIT(DDRCTRL->SWCTL, DDRCTRL_SWCTL_SW_DONE);
}

/* Wait quasi dynamic register update */
static HAL_StatusTypeDef wait_sw_done_ack(void)
{
  uint32_t swstat;
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_1_US);

  SET_BIT(DDRCTRL->SWCTL, DDRCTRL_SWCTL_SW_DONE);

  do
  {
    swstat = READ_REG(DDRCTRL->SWSTAT);

    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT; /* Timeout initialising DRAM */
    }
  }
  while ((swstat & DDRCTRL_SWSTAT_SW_DONE_ACK) == 0U);

  return HAL_OK;
}

/* Wait quasi dynamic register update */
static HAL_StatusTypeDef wait_operating_mode(uint32_t mode)
{
  uint32_t stat;
  int break_loop = 0;
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_1_US);

  for ( ; ; )
  {
    uint32_t operating_mode;
    uint32_t selref_type;

    stat = READ_REG(DDRCTRL->STAT);
    operating_mode = stat & DDRCTRL_STAT_OPERATING_MODE_Msk;
    selref_type = stat & DDRCTRL_STAT_SELFREF_TYPE_Msk;

    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT; /* Timeout initialising DRAM */
    }

    if (mode == DDRCTRL_STAT_OPERATING_MODE_SR)
    {
      /*
       * Self-refresh due to software
       * => checking also STAT.selfref_type.
       */
      if ((operating_mode == DDRCTRL_STAT_OPERATING_MODE_SR)
          && (selref_type == DDRCTRL_STAT_SELFREF_TYPE_SR))
      {
        break_loop = 1;
      }
    }
    else if (operating_mode == mode)
    {
      break_loop = 1;
    }
    else if ((mode == DDRCTRL_STAT_OPERATING_MODE_NORMAL)
             && (operating_mode == DDRCTRL_STAT_OPERATING_MODE_SR)
             && (selref_type == DDRCTRL_STAT_SELFREF_TYPE_ASR))
    {
      /* Normal mode: handle also automatic self refresh */
      break_loop = 1;
    }

    if (break_loop == 1)
    {
      break;
    }
  }

  return HAL_OK;
}

static void enable_axi_port(void)
{  /* Enable uMCTL2 AXI port 0 */
  SET_BIT(DDRCTRL->PCTRL_0, DDRCTRL_PCTRL_0_PORT_EN);

#ifdef DDR_DUAL_AXI_PORT
  /* Enable uMCTL2 AXI port 1 */
  SET_BIT(DDRCTRL->PCTRL_1, DDRCTRL_PCTRL_0_PORT_EN);
#endif
}

static int disable_axi_port(void)
{
  __IO uint32_t timeout;

  /* Disable uMCTL2 AXI port 0 */
  CLEAR_BIT(DDRCTRL->PCTRL_0, DDRCTRL_PCTRL_0_PORT_EN);
#ifdef DDR_DUAL_AXI_PORT
  CLEAR_BIT(DDRCTRL->PCTRL_1, DDRCTRL_PCTRL_0_PORT_EN);
#endif

  /* Waits unit all AXI ports are idle
   * Poll PSTAT.rd_port_busy_n = 0
   * Poll PSTAT.wr_port_busy_n = 0
   */
  timeout = ddr_timeout_init_us(DDR_TIMEOUT_1S);
  while (READ_REG(DDRCTRL->PSTAT))
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return -1;
    }
  }

  return 0;
}

static void enable_host_interface(void)
{
  CLEAR_BIT(DDRCTRL->DBG1, DDRCTRL_DBG1_DIS_HIF);
}

static int disable_host_interface(void)
{
  __IO uint32_t timeout;
  uint32_t dbgcam;
  int count = 0;

  SET_BIT(DDRCTRL->DBG1, DDRCTRL_DBG1_DIS_HIF);

