STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_ddr.c
  /*
   * Waits until all queues and pipelines are empty
   * Poll DBGCAM.dbg_wr_q_empty = 1
   * Poll DBGCAM.dbg_rd_q_empty = 1
   * Poll DBGCAM.dbg_wr_data_pipeline_empty = 1
   * Poll DBGCAM.dbg_rd_data_pipeline_empty = 1
   *
   * data_pipeline fields must be polled twice to ensure
   * value propoagation, so count is added to loop condition.
   */
  timeout = ddr_timeout_init_us(DDR_TIMEOUT_1S);
  do {
    dbgcam = READ_REG(DDRCTRL->DBGCAM);
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return -1;
    }
    count++;
  } while (((dbgcam & DDRCTRL_DBG_Q_AND_DATA_PIPELINE_EMPTY) !=
            DDRCTRL_DBG_Q_AND_DATA_PIPELINE_EMPTY) || (count < 2));

  return 0;
}

static int sw_selfref_entry(void)
{
  __IO uint32_t timeout;
  uint32_t stat;
  uint32_t operating_mode;
  uint32_t selref_type;

  /* SW Self-Refresh entry */
  SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_SW);

  /* Wait operating mode change in self-refresh mode
   * with STAT.operating_mode[1:0]==11.
   * Ensure transition to self-refresh was due to software
   * by checking also that STAT.selfref_type[1:0]=2.
   */
  timeout = ddr_timeout_init_us(DDR_TIMEOUT_500_US);

  while (!ddr_timeout_elapsed(timeout))
  {
    stat = READ_REG(DDRCTRL->STAT);
    operating_mode = stat & DDRCTRL_STAT_OPERATING_MODE_Msk;
    selref_type = stat & DDRCTRL_STAT_SELFREF_TYPE_Msk;
    timeout--;

    if ((operating_mode == DDRCTRL_STAT_OPERATING_MODE_SR)
        && (selref_type == DDRCTRL_STAT_SELFREF_TYPE_SR))
    {
      return 0;
    }
  }

  return -1;
}

static void sw_selfref_exit(void)
{
  CLEAR_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_SW);
}

static int set_qd3_update_conditions(void)
{
  if (disable_axi_port() != 0) {
    return -1;
  }
  disable_host_interface();
  start_sw_done();

  return 0;
}

static HAL_StatusTypeDef unset_qd3_update_conditions(void)
{
  HAL_StatusTypeDef ret;

  ret = wait_sw_done_ack();
  if (ret != HAL_OK)
  {
    return ret;
  }
  enable_host_interface();
  enable_axi_port();

  return ret;
}

static int wait_refresh_update_done_ack(void)
{
  __IO uint32_t timeout;
  uint32_t rfshctl3;
  uint32_t refresh_update_level  = DDRCTRL_RFSHCTL3_REFRESH_UPDATE_LEVEL;

  /* Toggle rfshctl3.refresh_update_level */
  rfshctl3 = READ_REG(DDRCTRL->RFSHCTL3);
  if ((rfshctl3 & refresh_update_level) == refresh_update_level) {
    SET_BIT(DDRCTRL->RFSHCTL3, refresh_update_level);
  } else {
    CLEAR_BIT(DDRCTRL->RFSHCTL3, refresh_update_level);
    refresh_update_level = 0U;
  }

  timeout = ddr_timeout_init_us(DDR_TIMEOUT_1S);
  do {
    rfshctl3 = READ_REG(DDRCTRL->RFSHCTL3);
    timeout--;

    if (ddr_timeout_elapsed(timeout)) {
      return -1;
    }
  } while ((rfshctl3 & DDRCTRL_RFSHCTL3_REFRESH_UPDATE_LEVEL) !=
           refresh_update_level);

  return 0;
}

/* Mode Register Writes (MRW or MRS) */
static HAL_StatusTypeDef mode_register_write(uint8_t addr, uint16_t data)
{
  uint32_t mrctrl0;
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_200_MS);

  /*
   * 1. Poll MRSTAT.mr_wr_busy until it is '0'.
   *    This checks that there is no outstanding MR transaction.
   *    No write should be performed to MRCTRL0 and MRCTRL1
   *    if MRSTAT.mr_wr_busy = 1.
   */
  while ((READ_REG(DDRCTRL->MRSTAT) & DDRCTRL_MRSTAT_MR_WR_BUSY) != 0U)
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT;
    }
  }

  /*
   * 2. Write the MRCTRL0.mr_type, MRCTRL0.mr_addr, MRCTRL0.mr_rank
   *    and (for MRWs) MRCTRL1.mr_data to define the MR transaction.
   */
  mrctrl0 = DDRCTRL_MRCTRL0_MR_TYPE_WRITE
            | DDRCTRL_MRCTRL0_MR_RANK_ALL
            | ((addr << DDRCTRL_MRCTRL0_MR_ADDR_Pos)
               & DDRCTRL_MRCTRL0_MR_ADDR_Msk);

  WRITE_REG(DDRCTRL->MRCTRL0, mrctrl0);
  WRITE_REG(DDRCTRL->MRCTRL1, data);

  /*
   * 3. In a separate APB transaction, write the MRCTRL0.mr_wr to 1. This
   *    bit is self-clearing, and triggers the MR transaction.
   *    The uMCTL2 then asserts the MRSTAT.mr_wr_busy while it performs
   *    the MR transaction to SDRAM, and no further access can be
   *    initiated until it is deasserted.
   */
  mrctrl0 |= DDRCTRL_MRCTRL0_MR_WR;
  WRITE_REG(DDRCTRL->MRCTRL0, mrctrl0);

  timeout = ddr_timeout_init_us(DDR_TIMEOUT_200_MS);
  while ((READ_REG(DDRCTRL->MRSTAT) & DDRCTRL_MRSTAT_MR_WR_BUSY) != 0U)
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT;
    }
  }

  return HAL_OK;
}

/* Switch DDR3 from DLL-on to DLL-off */
static HAL_StatusTypeDef ddr3_dll_off(void)
{
  HAL_StatusTypeDef ret = HAL_OK;
  uint32_t mr1 = READ_REG(DDRPHYC->MR1);
  uint32_t mr2 = READ_REG(DDRPHYC->MR2);
  uint32_t dbgcam;
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_200_MS);

  /*
   * 1. Set the DBG1.dis_hif = 1.
   *    This prevents further reads/writes being received on the HIF.
   */
  SET_BIT(DDRCTRL->DBG1, DDRCTRL_DBG1_DIS_HIF);

  /*
   * 2. Ensure all commands have been flushed from the uMCTL2 by polling
   *    DBGCAM.wr_data_pipeline_empty = 1,
   *    DBGCAM.rd_data_pipeline_empty = 1,
   *    DBGCAM.dbg_wr_q_depth = 0 ,
   *    DBGCAM.dbg_lpr_q_depth = 0, and
   *    DBGCAM.dbg_hpr_q_depth = 0.
   */
  do
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT;
    }

    dbgcam = READ_REG(DDRCTRL->DBGCAM);
  }
  while ((((dbgcam & DDRCTRL_DBGCAM_DATA_PIPELINE_EMPTY)
           == DDRCTRL_DBGCAM_DATA_PIPELINE_EMPTY))
         && ((dbgcam & DDRCTRL_DBGCAM_DBG_Q_DEPTH) == 0U));

  /*
   * 3. Perform an MRS command (using MRCTRL0 and MRCTRL1 registers)
   *    to disable RTT_NOM:
   *    a. DDR3: Write to MR1[9], MR1[6] and MR1[2]
   *    b. DDR4: Write to MR1[10:8]
   */
  mr1 &= ~(DDRPHYC_MR1_RTT0 | DDRPHYC_MR1_RTT1
           | DDRPHYC_MR1_RTT2);
  ret = mode_register_write(1, mr1);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   * 4. For DDR4 only: Perform an MRS command
   *    (using MRCTRL0 and MRCTRL1 registers) to write to MR5[8:6]
   *    to disable RTT_PARK
   */

