STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_ddr.c
  /*
   * 5. Perform an MRS command (using MRCTRL0 and MRCTRL1 registers)
   *    to write to MR2[10:9], to disable RTT_WR
   *    (and therefore disable dynamic ODT).
   *    This applies for both DDR3 and DDR4.
   */
  mr2 &= ~DDRPHYC_MR2_RTTWR_Msk;
  ret = mode_register_write(2, mr2);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   * 6. Perform an MRS command (using MRCTRL0 and MRCTRL1 registers)
   *    to disable the DLL. The timing of this MRS is automatically
   *    handled by the uMCTL2.
   *    a. DDR3: Write to MR1[0]
   *    b. DDR4: Write to MR1[0]
   */
  mr1 |= DDRPHYC_MR1_DE;
  ret = mode_register_write(1, mr1);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   * 7. Put the SDRAM into self-refresh mode by setting
   *    PWRCTL.selfref_sw = 1, and polling STAT.operating_mode to ensure
   *    the DDRC has entered self-refresh.
   */
  SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_SW);

  /*
   * 8. Wait until STAT.operating_mode[1:0]==11 indicating that the
   *    DWC_ddr_umctl2 core is in self-refresh mode.
   *    Ensure transition to self-refresh was due to software
   *    by checking that STAT.selfref_type[1:0]=2.
   */
  ret = wait_operating_mode(DDRCTRL_STAT_OPERATING_MODE_SR);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   * 9. Set the MSTR.dll_off_mode = 1.
   *    warning: MSTR.dll_off_mode is a quasi-dynamic type 2 field
   */
  start_sw_done();

  SET_BIT(DDRCTRL->MSTR, DDRCTRL_MSTR_DLL_OFF_MODE);

  ret = wait_sw_done_ack();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* 10. Change the clock frequency to the desired value. */

  /*
   * 11. Update any registers which may be required to change for the new
   *     frequency. This includes static and dynamic registers.
   *     This includes both uMCTL2 registers and PHY registers.
   */

  /* Change Bypass Mode Frequency Range (depends on DDRPHYC_CLK_RATE) */
  if (DDR_MEM_SPEED < 100000U)
  {
    CLEAR_BIT(DDRPHYC->DLLGCR, DDRPHYC_DLLGCR_BPS200);
  }
  else
  {
    SET_BIT(DDRPHYC->DLLGCR, DDRPHYC_DLLGCR_BPS200);
  }

  SET_BIT(DDRPHYC->ACDLLCR, DDRPHYC_ACDLLCR_DLLDIS);

  SET_BIT(DDRPHYC->DX0DLLCR, DDRPHYC_DX0DLLCR_DLLDIS);
  SET_BIT(DDRPHYC->DX1DLLCR, DDRPHYC_DX1DLLCR_DLLDIS);
#ifdef DDR_32BIT_INTERFACE
  SET_BIT(DDRPHYC->DX2DLLCR, DDRPHYC_DX2DLLCR_DLLDIS);
  SET_BIT(DDRPHYC->DX3DLLCR, DDRPHYC_DX3DLLCR_DLLDIS);
#endif

  /* 12. Exit the self-refresh state by setting PWRCTL.selfref_sw = 0. */
  CLEAR_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_SW);
  ret = wait_operating_mode(DDRCTRL_STAT_OPERATING_MODE_NORMAL);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   * 13. If ZQCTL0.dis_srx_zqcl = 0, the uMCTL2 performs a ZQCL command
   *     at this point.
   */

  /*
   * 14. Perform MRS commands as required to re-program timing registers
   *     in the SDRAM for the new frequency
   *     (in particular, CL, CWL and WR may need to be changed).
   */

  /* 15. Write DBG1.dis_hif = 0 to re-enable reads and writes. */
  CLEAR_BIT(DDRCTRL->DBG1, DDRCTRL_DBG1_DIS_HIF);

  return ret;
}

static HAL_StatusTypeDef HAL_DDR_Refresh_Disable(void)
{
  HAL_StatusTypeDef ret;

  /*
   * manage quasi-dynamic registers modification
   * dfimisc.dfi_init_complete_en : Group 3
   * AXI ports not yet enabled, don't disable them
   */
  if (disable_host_interface() != 0)
  {
    return HAL_ERROR;
  }

  start_sw_done();

  /* Quasi-dynamic register update*/
  SET_BIT(DDRCTRL->RFSHCTL3, DDRCTRL_RFSHCTL3_DIS_AUTO_REFRESH);

  if (wait_refresh_update_done_ack() != 0)
  {
    return HAL_ERROR;
  }

  CLEAR_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_POWERDOWN_EN
                          | DDRCTRL_PWRCTL_SELFREF_EN);
  CLEAR_BIT(DDRCTRL->DFIMISC, DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);

  ret = wait_sw_done_ack();
  if (ret != HAL_OK)
  {
    return ret;
  }

  enable_host_interface();

  return HAL_OK;
}

static HAL_StatusTypeDef HAL_DDR_Refresh_Restore(uint32_t rfshctl3, uint32_t pwrctl)
{
  HAL_StatusTypeDef ret;

  /*
   * manage quasi-dynamic registers modification
   * dfimisc.dfi_init_complete_en : Group 3
   * AXI ports not yet enabled, don't disable them
   */
  if (disable_host_interface() != 0)
  {
    return HAL_ERROR;
  }

  start_sw_done();

  if ((rfshctl3 & DDRCTRL_RFSHCTL3_DIS_AUTO_REFRESH) == 0U)
  {
    CLEAR_BIT(DDRCTRL->RFSHCTL3, DDRCTRL_RFSHCTL3_DIS_AUTO_REFRESH);
    if (wait_refresh_update_done_ack() != 0)
    {
      return HAL_ERROR;
    }
  }

  if ((pwrctl & DDRCTRL_PWRCTL_POWERDOWN_EN) != 0U)
  {
    SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_POWERDOWN_EN);
  }

  if ((pwrctl & DDRCTRL_PWRCTL_SELFREF_EN) != 0U)
  {
    SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_EN);
  }

  SET_BIT(DDRCTRL->DFIMISC, DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);

  ret = wait_sw_done_ack();
  if (ret != HAL_OK)
  {
    return ret;
  }

  enable_host_interface();

  return HAL_OK;
}

static unsigned long get_timer(unsigned long base)
{
  return (unsigned long)PL1_GetCurrentPhysicalValue() - base;
}

static HAL_StatusTypeDef refresh_cmd(void)
{
  uint32_t dbgstat;
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_200_MS);

  do
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT;
    }

    dbgstat = READ_REG(DDRCTRL->DBGSTAT);
  }
  while ((dbgstat & DDRCTRL_DBGSTAT_RANK0_REFRESH_BUSY) != 0U);

  SET_BIT(DDRCTRL->DBGCMD, DDRCTRL_DBGCMD_RANK0_REFRESH);

  return HAL_OK;
}

/* Refresh compensation by forcing refresh command
 * Rule1: Tref should be always < tREFW ? R x tREBW/8
 * Rule2: refcomp = RU(Tref/tREFI)  = RU(RxTref/tREFW)
 */
static HAL_StatusTypeDef refresh_compensation(unsigned long start)
{
  HAL_StatusTypeDef res = HAL_OK;
  uint32_t tck_ps, tref, trefi, refcomp;
  int i;
  unsigned long time;
  unsigned long time_us;

  time = get_timer(start);
  time_us = (unsigned long)(time / TIMESLOT_1US);

  tck_ps = 1000000000U / static_ddr_config.info.speed;
  if (tck_ps == 0U)
  {
    return res;
  }

  /* ref = refresh time in tck */
  tref = time_us * 1000000U / tck_ps;

  trefi = ((READ_REG(DDRCTRL->RFSHTMG) & DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Msk)
           >> DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos) * 32U;
  if (trefi == 0U)
  {
    return res;
  }

