STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_ddr.c
  /* div round up : number of refresh to compensate */
  refcomp = (tref + trefi - 1U) / trefi;

  for (i = 0; i < refcomp; i++)
  {
    res = refresh_cmd();
    if (res != HAL_OK)
    {
      return res;
    }
  }

  return res;
}

static int ddr_sw_self_refresh_in(void)
{
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);

  if (disable_axi_port() != 0)
  {
    goto pstat_failed;
  }

  /* SW Self-Refresh entry */
  if (sw_selfref_entry() != 0U)
  {
    goto selfref_sw_failed;
  }

  /* IOs powering down (PUBL registers) */
  SET_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_ACPDD);
  SET_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_ACPDR);
  MODIFY_REG(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_CKPDD_Msk, DDRPHYC_ACIOCR_CKPDD_0);
  MODIFY_REG(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_CKPDR_Msk, DDRPHYC_ACIOCR_CKPDR_0);
  SET_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_CSPDD);

  /* Disable command/address output driver */
  CLEAR_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_ACOE);
  SET_BIT(DDRPHYC->DXCCR, DDRPHYC_DXCCR_DXPDD);
  SET_BIT(DDRPHYC->DXCCR, DDRPHYC_DXCCR_DXPDR);
  SET_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_ODTPDD);
  SET_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_NL2PD);
  SET_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_CKEPDD);

  /* Disable PZQ cell (PUBL register) */
  SET_BIT(DDRPHYC->ZQ0CR0, DDRPHYC_ZQ0CR0_ZQPD);

  /* Set latch */
  CLEAR_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_CKOE);

  /* Additional delay to avoid early latch, 10us */
  ddr_delay_us(DDR_DELAY_10_US );

  /* Activate sw retention in PWRCTRL */
  SET_BIT(PWR->CR3, PWR_CR3_DDRRETEN);

  /* Switch controller clocks (uMCTL2/PUBL) to DLL ref clock */
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_GSKPCTRL);

  /* Disable all DLLs: GLITCH window */
  SET_BIT(DDRPHYC->ACDLLCR, DDRPHYC_ACDLLCR_DLLDIS);
  SET_BIT(DDRPHYC->DX0DLLCR, DDRPHYC_DX0DLLCR_DLLDIS);
  SET_BIT(DDRPHYC->DX1DLLCR, DDRPHYC_DX1DLLCR_DLLDIS);
#ifdef DDR_32BIT_INTERFACE
  SET_BIT(DDRPHYC->DX2DLLCR, DDRPHYC_DX2DLLCR_DLLDIS);
  SET_BIT(DDRPHYC->DX3DLLCR, DDRPHYC_DX3DLLCR_DLLDIS);
#endif

  /* Switch controller clocks (uMCTL2/PUBL) to DLL output clock */
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_GSKPCTRL);

  /* Deactivate all DDR clocks */
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC1EN
#ifdef DDR_DUAL_AXI_PORT
                           | RCC_DDRITFCR_DDRC2EN
#endif
                           | RCC_DDRITFCR_DDRCAPBEN
                           | RCC_DDRITFCR_DDRPHYCAPBEN);

  return 0;

selfref_sw_failed:
  /* Restore DDR in its previous state */
  sw_selfref_exit();

pstat_failed:
  enable_axi_port();

  return -1;
}

/*******************************************************************************
 * This function tests a simple read/write access to the DDR.
 * Note that the previous content is restored after test.
 * Returns 0 if success, and address value else.
 ******************************************************************************/
static uint32_t ddr_test_rw_access(void)
{
  uint32_t saved_value = READ_REG(DDR_BASE_ADDR);

  WRITE_REG(*(volatile uint32_t*)DDR_BASE_ADDR, DDR_PATTERN);

  if (READ_REG(DDR_BASE_ADDR) != DDR_PATTERN)
  {
    return (uint32_t)DDR_BASE_ADDR;
  }

  WRITE_REG(*(volatile uint32_t*)DDR_BASE_ADDR, saved_value);

  return 0;
}

/*******************************************************************************
 * This function tests the DDR data bus wiring.
 * This is inspired from the Data Bus Test algorithm written by Michael Barr
 * in "Programming Embedded Systems in C and C++" book.
 * resources.oreilly.com/examples/9781565923546/blob/master/Chapter6/
 * File: memtest.c - This source code belongs to Public Domain.
 * Returns 0 if success, and address value else.
 ******************************************************************************/
static uint32_t ddr_test_data_bus(void)
{
  uint32_t pattern;

  for (pattern = 1U; pattern != 0U; pattern <<= 1)
  {
    WRITE_REG(*(volatile uint32_t*)DDR_BASE_ADDR, pattern);

    if (READ_REG(*(volatile uint32_t*)DDR_BASE_ADDR) != pattern)
    {
      return (uint32_t)DDR_BASE_ADDR;
    }
  }

  return 0;
}

/*******************************************************************************
 * This function tests the DDR address bus wiring.
 * This is inspired from the Data Bus Test algorithm written by Michael Barr
 * in "Programming Embedded Systems in C and C++" book.
 * resources.oreilly.com/examples/9781565923546/blob/master/Chapter6/
 * File: memtest.c - This source code belongs to Public Domain.
 * Returns 0 if success, and address value else.
 ******************************************************************************/
static uint32_t ddr_test_addr_bus(void)
{
  uint64_t addressmask = (static_ddr_config.info.size - 1U);
  uint64_t offset;
  uint64_t testoffset = 0;

  /* Write the default pattern at each of the power-of-two offsets. */
  for (offset = sizeof(uint32_t); (offset & addressmask) != 0U; offset <<= 1)
  {
    WRITE_REG(*(volatile uint32_t*)(DDR_BASE_ADDR + (uint32_t)offset),
              DDR_PATTERN);
  }

  /* Check for address bits stuck high. */
  WRITE_REG(*(volatile uint32_t*)(DDR_BASE_ADDR + (uint32_t)testoffset),
            DDR_ANTIPATTERN);

  for (offset = sizeof(uint32_t); (offset & addressmask) != 0U; offset <<= 1)
  {
    if (READ_REG(*(volatile uint32_t*)(DDR_BASE_ADDR + (uint32_t)offset))
        != DDR_PATTERN)
    {
      return (uint32_t)(DDR_BASE_ADDR + offset);
    }
  }

  WRITE_REG(*(volatile uint32_t*)(DDR_BASE_ADDR + (uint32_t)testoffset),
            DDR_PATTERN);

  /* Check for address bits stuck low or shorted. */
  for (testoffset = sizeof(uint32_t); (testoffset & addressmask) != 0U;
       testoffset <<= 1)
  {
    WRITE_REG(*(volatile uint32_t*)(DDR_BASE_ADDR + (uint32_t)testoffset),
              DDR_ANTIPATTERN);

    if (READ_REG(*(volatile uint32_t*)DDR_BASE_ADDR) != DDR_PATTERN)
    {
      return DDR_BASE_ADDR;
    }

    for (offset = sizeof(uint32_t); (offset & addressmask) != 0U;
         offset <<= 1)
    {
      if ((READ_REG(*(volatile uint32_t*)(DDR_BASE_ADDR + (uint32_t)offset))
           != DDR_PATTERN)
          && (offset != testoffset))
      {
        return (uint32_t)(DDR_BASE_ADDR + offset);
      }
    }

    WRITE_REG(*(volatile uint32_t*)(DDR_BASE_ADDR + (uint32_t)testoffset),
              DDR_PATTERN);
  }

