STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_ddr.c
  return 0;
}

/*******************************************************************************
 * This function checks the DDR size. It has to be run with Data Cache off.
 * This test is run before data have been put in DDR, and is only done for
 * cold boot. The DDR data can then be overwritten, and it is not useful to
 * restore its content.
 * Returns DDR computed size.
 ******************************************************************************/
static uint32_t ddr_check_size(void)
{
  uint32_t offset = sizeof(uint32_t);

  WRITE_REG(*(volatile uint32_t*)DDR_BASE_ADDR, DDR_PATTERN);

  while (offset < DDR_MAX_SIZE)
  {
    WRITE_REG(*(volatile uint32_t*)(DDR_BASE_ADDR + offset), DDR_ANTIPATTERN);
    __DSB();

    if (READ_REG(*(volatile uint32_t*)DDR_BASE_ADDR) != DDR_PATTERN)
    {
      break;
    }

    offset <<= 1;
  }

  return offset;
}

static bool ddr_supports_ssr_asr(void)
{
  uint32_t mstr = READ_REG(DDRCTRL->MSTR);

  return (mstr & DDRCTRL_MSTR_LPDDR2) != 0U;
}

static HAL_StatusTypeDef ddr_sr_mode_ssr(void)
{
  HAL_StatusTypeDef ret;

  if (!ddr_supports_ssr_asr())
  {
    return HAL_OK;
  }

  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC1LPEN);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC1EN);
#ifdef DDR_DUAL_AXI_PORT
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC2LPEN);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC2EN);
#endif
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCAPBLPEN);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRPHYCAPBLPEN);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCAPBEN);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRPHYCAPBEN);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRPHYCEN);
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCKMOD_Msk);

  /*
   * manage quasi-dynamic registers modification
   * hwlpctl.hw_lp_en : Group 3
   * pwrtmg.selfref_to_x32 & powerdown_to_x32 : Group 4
   * Group 3 is the most restrictive, apply its conditions for all
   */
  if (set_qd3_update_conditions() != 0)
  {
    return HAL_ERROR;
  }

  /* Disable HW LP interface of uMCTL2 */
  CLEAR_BIT(DDRCTRL->HWLPCTL, DDRCTRL_HWLPCTL_HW_LP_EN);

  /* Configure Automatic LP modes of uMCTL2 */
  MODIFY_REG(DDRCTRL->PWRTMG, DDRCTRL_PWRTMG_SELFREF_TO_X32_Msk,
                           DDRCTRL_PWRTMG_SELFREF_TO_X32_0);

  ret = unset_qd3_update_conditions();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   * Disable Clock disable with LP modes
   * (used in RUN mode for LPDDR2 with specific timing).
   */
  CLEAR_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE);

  /* Disable automatic Self-Refresh mode */
  CLEAR_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_EN);

  return ret;
}

static HAL_StatusTypeDef ddr_sr_mode_asr(void)
{
  HAL_StatusTypeDef ret;

  if (!ddr_supports_ssr_asr())
  {
    return HAL_OK;
  }

  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC1LPEN);
#ifdef DDR_DUAL_AXI_PORT
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC2LPEN);
#endif
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRPHYCLPEN);
  MODIFY_REG(RCC->DDRITFCR, RCC_DDRITFCR_DDRCKMOD_Msk,
                            RCC_DDRITFCR_DDRCKMOD_ASR1);

  /*
   * manage quasi-dynamic registers modification
   * hwlpctl.hw_lp_en : Group 3
   * pwrtmg.selfref_to_x32 & powerdown_to_x32 : Group 4
   * Group 3 is the most restrictive, apply its conditions for all
   */
  if (set_qd3_update_conditions() != 0)
  {
    return HAL_ERROR;
  }

  /* Enable HW LP interface of uMCTL2 */
  SET_BIT(DDRCTRL->HWLPCTL, DDRCTRL_HWLPCTL_HW_LP_EN);

  /* Configure Automatic LP modes of uMCTL2 */
  MODIFY_REG(DDRCTRL->PWRTMG, DDRCTRL_PWRTMG_SELFREF_TO_X32_Msk,
                           DDRCTRL_PWRTMG_SELFREF_TO_X32_0);

  ret = unset_qd3_update_conditions();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   * Enable Clock disable with LP modes
   * (used in RUN mode for LPDDR2 with specific timing).
   */
  SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE);

  /* Enable automatic Self-Refresh for ASR mode */
  SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_EN);

  return ret;
}

static HAL_StatusTypeDef ddr_sr_mode_hsr(void)
{
  HAL_StatusTypeDef ret;

  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC1LPEN);
#ifdef DDR_DUAL_AXI_PORT
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRC2LPEN);
#endif
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRPHYCLPEN);
  MODIFY_REG(RCC->DDRITFCR, RCC_DDRITFCR_DDRCKMOD_Msk,
                            RCC_DDRITFCR_DDRCKMOD_HSR1);

  /*
   * manage quasi-dynamic registers modification
   * hwlpctl.hw_lp_en : Group 3
   * pwrtmg.selfref_to_x32 & powerdown_to_x32 : Group 4
   * Group 3 is the most restrictive, apply its conditions for all
   */
  if (set_qd3_update_conditions() != 0)
  {
    return HAL_ERROR;
  }

  /* Enable HW LP interface of uMCTL2 */
  SET_BIT(DDRCTRL->HWLPCTL, DDRCTRL_HWLPCTL_HW_LP_EN);

  /* Configure Automatic LP modes of uMCTL2 */
  MODIFY_REG(DDRCTRL->PWRTMG, DDRCTRL_PWRTMG_SELFREF_TO_X32_Msk,
                           DDRCTRL_PWRTMG_SELFREF_TO_X32_0);

  ret = unset_qd3_update_conditions();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   * Enable Clock disable with LP modes
   * (used in RUN mode for LPDDR2 with specific timing).
   */
  SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE);

  return ret;
}

static HAL_DDR_SelfRefreshModeTypeDef ddr_sr_read_mode(void)
{
  uint32_t pwrctl = READ_REG(DDRCTRL->PWRCTL);

  switch (pwrctl &(DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE |
                   DDRCTRL_PWRCTL_SELFREF_EN))
  {
  case 0U:
    return HAL_DDR_SW_SELF_REFRESH_MODE;
  case DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE:
    return HAL_DDR_HW_SELF_REFRESH_MODE;
  case DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE | DDRCTRL_PWRCTL_SELFREF_EN:
    return HAL_DDR_AUTO_SELF_REFRESH_MODE;
  default:
    return HAL_DDR_INVALID_MODE;
  }
}

/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/

/** @defgroup DDR_Exported_Functions DDR Exported Functions
  * @{
  */


/**
  * @brief  DDR init sequence, including
  *         - reset/clock/power management (i.e. access to other IPs),
  *         - DDRCTRL and DDRPHY configuration and initialization,
  *         - self-refresh mode setup,
  *         - data/addr tests execution after training.
  * @param  DDR initialisation structure
  * @retval None.
  */
HAL_StatusTypeDef HAL_DDR_Init(DDR_InitTypeDef *iddr)
{
  HAL_StatusTypeDef ret = HAL_OK;
  int iret = -EINVAL;
  uint32_t ddr_reten;
  uint32_t pir;
  uint32_t uret;
  unsigned long time;
  char bus_width;

