STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_ddr.c
  iddr->self_refresh = false;

  if (iddr->wakeup_from_standby)
  {
    iddr->self_refresh = true;
  }

  /* Disable axidcg clock gating during init */
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);

  switch (static_ddr_config.c_reg.MSTR & DDRCTRL_MSTR_DATA_BUS_WIDTH)
  {
  case DDRCTRL_MSTR_DATA_BUS_WIDTH_QUARTER:
    bus_width = 8;
    break;
  case DDRCTRL_MSTR_DATA_BUS_WIDTH_HALF:
    bus_width = 16;
    break;
  default:
    bus_width = 32;
    break;
  }


  if ((static_ddr_config.c_reg.MSTR & DDRCTRL_MSTR_DDR3) != 0U)
  {
    iret = HAL_DDR_MspInit(STM32MP_DDR3);
  }
  else if ((static_ddr_config.c_reg.MSTR & DDRCTRL_MSTR_LPDDR2) != 0U)
  {
    if (bus_width == 32)
    {
      iret = HAL_DDR_MspInit(STM32MP_LPDDR2_32);
    }
    else
    {
      iret = HAL_DDR_MspInit(STM32MP_LPDDR2_16);
    }
  }
  else if ((static_ddr_config.c_reg.MSTR & DDRCTRL_MSTR_LPDDR3) != 0U)
  {
    if (bus_width == 32)
    {
      iret = HAL_DDR_MspInit(STM32MP_LPDDR3_32);
    }
    else
    {
      iret = HAL_DDR_MspInit(STM32MP_LPDDR3_16);
    }
  }

  if (iret != 0)
  {
   return HAL_ERROR;
  }

  /* Check DDR PHY pads retention */
  ddr_reten = READ_REG(PWR->CR3) & PWR_CR3_DDRRETEN;
  if (iddr->self_refresh)
  {
    if (ddr_reten == 0U)
    {
      iddr->self_refresh = false;
    }
  }
  else
  {
    if (ddr_reten != 0U)
    {
      SET_BIT(PWR->CR3, PWR_CR3_DDRSRDIS);
      CLEAR_BIT(PWR->CR3, PWR_CR3_DDRRETEN);
    }
  }

start:
  /* DDR INIT SEQUENCE */

  /*
   * 1. Program the DWC_ddr_umctl2 registers
   *     nota: check DFIMISC.dfi_init_complete = 0
   */

  /* 1.1 RESETS: presetn, core_ddrc_rstn, aresetn */
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCAPBRST);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCAXIRST);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCORERST);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DPHYAPBRST);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DPHYRST);
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DPHYCTLRST);

  /* 1.2. start CLOCK */
  if (ddr_clk_enable(static_ddr_config.info.speed) != 0)
  {
    return HAL_ERROR;
  }

  /* 1.3. deassert reset */
  /* De-assert PHY rstn and ctl_rstn via DPHYRST and DPHYCTLRST. */
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DPHYRST);
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DPHYCTLRST);
  /*
   * De-assert presetn once the clocks are active
   * and stable via DDRCAPBRST bit.
   */
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCAPBRST);

  /* 1.4. wait 128 cycles to permit initialization of end logic */
  /* For PCLK = 133MHz => 1 us is enough, 2 to allow lower frequency */
  ddr_delay_us(DDR_DELAY_END_LOGIC_INIT_US);

  if (INTERACTIVE(STEP_DDR_RESET))
  {
    goto start;
  }

  /* 1.5. initialize registers ddr_umctl2 */
  /* Stop uMCTL2 before PHY is ready */
  CLEAR_BIT(DDRCTRL->DFIMISC, DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);

  ret = set_reg(REG_REG, &static_ddr_config.c_reg);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* DDR3 = don't set DLLOFF for init mode */
  if ((static_ddr_config.c_reg.MSTR
       & (DDRCTRL_MSTR_DDR3 | DDRCTRL_MSTR_DLL_OFF_MODE))
      == (DDRCTRL_MSTR_DDR3 | DDRCTRL_MSTR_DLL_OFF_MODE))
  {
    CLEAR_BIT(DDRCTRL->MSTR, DDRCTRL_MSTR_DLL_OFF_MODE);
  }

  ret = set_reg(REG_TIMING, &static_ddr_config.c_timing);
  if (ret != HAL_OK)
  {
    return ret;
  }
  ret = set_reg(REG_MAP, &static_ddr_config.c_map);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* Keep the controller in self-refresh mode */
  if (iddr->self_refresh)
  {
    SET_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_SW);
  }

  /* Skip CTRL init, SDRAM init is done by PHY PUBL */
  MODIFY_REG(DDRCTRL->INIT0, DDRCTRL_INIT0_SKIP_DRAM_INIT_Msk,
             DDRCTRL_INIT0_SKIP_DRAM_INIT_NORMAL);

  ret = set_reg(REG_PERF, &static_ddr_config.c_perf);
  if (ret != HAL_OK)
  {
    return ret;
  }

  if (INTERACTIVE(STEP_CTL_INIT))
  {
    goto start;
  }

  /*  2. deassert reset signal core_ddrc_rstn, aresetn and presetn */
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCORERST);
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DDRCAXIRST);
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_DPHYAPBRST);

  /*
   * 3. start PHY init by accessing relevant PUBL registers
   *    (DXGCR, DCR, PTR*, MR*, DTPR*)
   */
  ret = set_reg(REGPHY_REG, &static_ddr_config.p_reg);
    if (ret != HAL_OK)
  {
    return ret;
  }
  ret = set_reg(REGPHY_TIMING, &static_ddr_config.p_timing);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* DDR3 = don't set DLLOFF for init mode */
  if ((static_ddr_config.c_reg.MSTR
       & (DDRCTRL_MSTR_DDR3 | DDRCTRL_MSTR_DLL_OFF_MODE))
      == (DDRCTRL_MSTR_DDR3 | DDRCTRL_MSTR_DLL_OFF_MODE))
  {
    CLEAR_BIT(DDRPHYC->MR1, DDRPHYC_MR1_DE);
  }

  if (INTERACTIVE(STEP_PHY_INIT))
  {
    goto start;
  }

  /*
   *  4. Monitor PHY init status by polling PUBL register PGSR.IDONE
   *     Perform DDR PHY DRAM initialization and Gate Training Evaluation
   */
  ret = ddrphy_idone_wait();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   *  5. Indicate to PUBL that controller performs SDRAM initialization
   *     by setting PIR.INIT and PIR CTLDINIT and pool PGSR.IDONE
   *     DRAM init is done by PHY, init0.skip_dram.init = 1
   */

  pir = DDRPHYC_PIR_DLLSRST | DDRPHYC_PIR_DLLLOCK | DDRPHYC_PIR_ZCAL
        | DDRPHYC_PIR_ITMSRST | DDRPHYC_PIR_DRAMINIT | DDRPHYC_PIR_ICPC;

  if ((static_ddr_config.c_reg.MSTR & DDRCTRL_MSTR_DDR3) != 0U)
  {
    pir |= DDRPHYC_PIR_DRAMRST; /* Only for DDR3 */
  }


  /* Treat self-refresh exit : hot boot */
  if (iddr->self_refresh)
  {
    /* DDR in self refresh mode, remove zcal & reset & init */
    pir &= ~(DDRPHYC_PIR_ZCAL & DDRPHYC_PIR_DRAMRST
             & DDRPHYC_PIR_DRAMINIT);
    pir |= DDRPHYC_PIR_ZCALBYP;
  }

  ret = HAL_DDR_PHY_Init(pir);
  if (ret != HAL_OK)
  {
    return ret;
  }

  if (iddr->self_refresh)
  {
    ret = self_refresh_zcal(iddr->zdata);
    if (ret != HAL_OK)
    {
      return ret;
    }
  }

  /*
   *  6. SET DFIMISC.dfi_init_complete_en to 1
   *  Enable quasi-dynamic register programming.
   */
  start_sw_done();

  SET_BIT(DDRCTRL->DFIMISC, DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);

