STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP1xx_HAL_Driver/Src/stm32mp1xx_hal_ddr.c
  ret = wait_sw_done_ack();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   *  7. Wait for DWC_ddr_umctl2 to move to normal operation mode
   *     by monitoring STAT.operating_mode signal
  */

  /* Wait uMCTL2 ready */

  /* Trigger self-refresh exit */
  if (iddr->self_refresh)
  {
    CLEAR_BIT(DDRCTRL->PWRCTL, DDRCTRL_PWRCTL_SELFREF_SW);
  }

  ret = wait_operating_mode(DDRCTRL_STAT_OPERATING_MODE_NORMAL);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* Switch to DLL OFF mode */
  if ((static_ddr_config.c_reg.MSTR & DDRCTRL_MSTR_DLL_OFF_MODE) != 0U)
  {
    ret = ddr3_dll_off();
    if (ret != HAL_OK)
    {
      return ret;
    }
  }


  /* DDR DQS training done */

  time = get_timer(0);

  /*
   *  8. Disable Auto refresh and power down by setting
   *    - RFSHCTL3.dis_au_refresh = 1
   *    - PWRCTL.powerdown_en = 0
   *    - DFIMISC.dfiinit_complete_en = 0
   */
  ret = HAL_DDR_Refresh_Disable();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /*
   *  9. Program PUBL PGCR to enable refresh during training
   *     and rank to train
   *     not done => keep the programed value in PGCR
   */

  /*
   * 10. configure PUBL PIR register to specify which training
   *     step to run
   *     RVTRN is executed only on LPDDR2/LPDDR3
   */
  pir = DDRPHYC_PIR_QSTRN;
  if ((static_ddr_config.c_reg.MSTR & DDRCTRL_MSTR_DDR3) == 0U)
  {
    pir |= DDRPHYC_PIR_RVTRN;
  }

  ret = HAL_DDR_PHY_Init(pir);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* 11. monitor PUB PGSR.IDONE to poll cpmpletion of training
   *     sequence
   */
  ret = ddrphy_idone_wait();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* Refresh compensation: forcing refresh command */
  if (iddr->self_refresh)
  {
    ret = refresh_compensation(time);
    if (ret != HAL_OK)
    {
      return ret;
    }
  }

  /*
   * 12. set back registers in step 8 to the orginal values
   *     if desidered
   */
  ret = HAL_DDR_Refresh_Restore(static_ddr_config.c_reg.RFSHCTL3,
                                static_ddr_config.c_reg.PWRCTL);
  if (ret != HAL_OK)
  {
    return ret;
  }


  enable_axi_port();

  if (INTERACTIVE(STEP_DDR_READY))
  {
    goto start;
  }

  /* Enable axidcg clock gating */
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);

  /* check if DDR content is lost (self-refresh aborted) */
  if ((iddr->wakeup_from_standby) && !iddr->self_refresh)
  {
    iddr->clear_bkp = true;
  }

#ifndef DCACHE_OFF
  __set_SCTLR(__get_SCTLR() & ~SCTLR_C_BIT);
#endif

  if (iddr->self_refresh)
  {
    uret = ddr_test_rw_access();
    if (uret != 0U)
    {
      return HAL_ERROR;
    }

    /* Restore area overwritten by training */
    restore_ddr_training_area();
  }
  else
  {
    uret = ddr_test_data_bus();
    if (uret != 0U)
    {
      return HAL_ERROR;
    }

    uret = ddr_test_addr_bus();
    if (uret != 0U)
    {
      return HAL_ERROR;
    }

    uret = ddr_check_size();
    if (uret < static_ddr_config.info.size)
    {
      return HAL_ERROR;
    }
  }

  /* Switch to Self-Refresh mode defined by the settings */
  if (HAL_DDR_SR_SetMode(ddr_sr_read_mode()) != HAL_OK)
  {
    /* Unable to switch to the predefined self-refresh mode */
    return HAL_ERROR;
  }

#ifndef DCACHE_OFF
  __set_SCTLR(__get_SCTLR() | SCTLR_C_BIT);
#endif

  return ret;
}

/**
  * @brief  Enable DDR Self-Refresh, in low power cases (when entering in CSTOP
  *         or before shutting down).
  * @param  zq0cr0_zdata IO calibration value.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DDR_SR_Entry(uint32_t *zq0cr0_zdata)
{
  /* Save IOs calibration values */
  if (zq0cr0_zdata != NULL)
  {
    *zq0cr0_zdata = READ_REG(DDRPHYC->ZQ0CR0) & DDRPHYC_ZQ0CR0_ZDATA_Msk;
  }

  /* Put DDR in Self-Refresh */
  if (ddr_sw_self_refresh_in() != 0)
  {
    return HAL_ERROR;
  }

 /* Enable I/O retention mode in standby */
  SET_BIT(PWR->CR3, PWR_CR3_DDRSREN);

  return HAL_OK;
}

/**
  * @brief  Remove DDR Self-Refresh on low power cases (when exiting from
  *         CSTOP).
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DDR_SR_Exit(void)
{
  HAL_StatusTypeDef ret = HAL_OK;
  __IO uint32_t timeout;

  /* Enable all clocks */
  ddr_enable_clock();

  /*
   * manage quasi-dynamic registers modification
   * dfimisc.dfi_init_complete_en : Group 3
   */
  if (set_qd3_update_conditions() != 0)
  {
    return HAL_ERROR;
  }

  /* Mask dfi_init_complete_en */
  CLEAR_BIT(DDRCTRL->DFIMISC, DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);

  ret = unset_qd3_update_conditions();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* Switch controller clocks (uMCTL2/PUBL) to DLL ref clock */
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_GSKPCTRL);

  /* Enable all DLLs: GLITCH window */
  CLEAR_BIT(DDRPHYC->ACDLLCR, DDRPHYC_ACDLLCR_DLLDIS);
  CLEAR_BIT(DDRPHYC->DX0DLLCR, DDRPHYC_DX0DLLCR_DLLDIS);
  CLEAR_BIT(DDRPHYC->DX1DLLCR, DDRPHYC_DX1DLLCR_DLLDIS);
#ifdef DDR_32BIT_INTERFACE
  CLEAR_BIT(DDRPHYC->DX2DLLCR, DDRPHYC_DX2DLLCR_DLLDIS);
  CLEAR_BIT(DDRPHYC->DX3DLLCR, DDRPHYC_DX3DLLCR_DLLDIS);
#endif

  /* Additional delay to avoid early DLL clock switch */
  ddr_delay_us(DDR_DELAY_10_US);

  /* Switch controller clocks (uMCTL2/PUBL) to DLL ref clock */
  CLEAR_BIT(RCC->DDRITFCR, RCC_DDRITFCR_GSKPCTRL);

  CLEAR_BIT(DDRPHYC->ACDLLCR, DDRPHYC_ACDLLCR_DLLSRST);

  ddr_delay_us(DDR_DELAY_10_US);

  SET_BIT(DDRPHYC->ACDLLCR, DDRPHYC_ACDLLCR_DLLSRST);

  /* PHY partial init: (DLL lock and ITM reset) */
  WRITE_REG(DDRPHYC->PIR, DDRPHYC_PIR_DLLSRST | DDRPHYC_PIR_DLLLOCK
                          | DDRPHYC_PIR_ITMSRST | DDRPHYC_PIR_INIT);

  /* Need to wait at least 10 clock cycles before accessing PGSR */
  ddr_delay_us(DDR_DELAY_1_US);

  /* Pool end of init */
  timeout = ddr_timeout_init_us(DDR_TIMEOUT_500_US);

  while ((READ_REG(DDRPHYC->PGSR) & DDRPHYC_PGSR_IDONE) == 0U)
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT;
    }
  }

  /*
   * manage quasi-dynamic registers modification
   * dfimisc.dfi_init_complete_en : Group 3
   */
  if (set_qd3_update_conditions() != 0)
  {
    return HAL_ERROR;
  }

  /* Unmask dfi_init_complete_en to uMCTL2 */
  SET_BIT(DDRCTRL->DFIMISC, DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);

  ret = unset_qd3_update_conditions();
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* Deactivate sw retention in PWR */
  CLEAR_BIT(PWR->CR3, PWR_CR3_DDRRETEN);

  /* Enable PZQ cell (PUBL register) */
  CLEAR_BIT(DDRPHYC->ZQ0CR0, DDRPHYC_ZQ0CR0_ZQPD);

  /* Enable pad drivers */
  CLEAR_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_ACPDD);

  /* Enable command/address output driver */
  SET_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_ACOE);
  CLEAR_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_CKPDD_Msk);
  CLEAR_BIT(DDRPHYC->ACIOCR, DDRPHYC_ACIOCR_CSPDD_Msk);
  CLEAR_BIT(DDRPHYC->DXCCR, DDRPHYC_DXCCR_DXPDD);
  CLEAR_BIT(DDRPHYC->DXCCR, DDRPHYC_DXCCR_DXPDR);

  /* Release latch */
  SET_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_CKOE);
  CLEAR_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_ODTPDD_Msk);
  CLEAR_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_NL2PD);
  CLEAR_BIT(DDRPHYC->DSGCR, DDRPHYC_DSGCR_CKEPDD_Msk);

  /* Remove selfrefresh */
  sw_selfref_exit();

  /* Wait operating_mode == normal */
  timeout = ddr_timeout_init_us(DDR_TIMEOUT_500_US);

  while ((READ_REG(DDRCTRL->STAT) & DDRCTRL_STAT_OPERATING_MODE_Msk)
         != DDRCTRL_STAT_OPERATING_MODE_NORMAL)
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return HAL_TIMEOUT;
    }
  }

  /* AXI ports are no longer blocked from taking transactions */
  enable_axi_port();
  SET_BIT(RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);

  return ret;
}

/**
  * @brief  Activate either HW, or SW or automatic self-refresh, in low power
  *         cases (when entering in or exiting from CSTOP).
  * @param  mode Self-refresh mode.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DDR_SR_SetMode(HAL_DDR_SelfRefreshModeTypeDef mode)
{
  switch (mode)
  {
  case HAL_DDR_SW_SELF_REFRESH_MODE:
    return ddr_sr_mode_ssr();
  case HAL_DDR_AUTO_SELF_REFRESH_MODE:
    return ddr_sr_mode_asr();
  case HAL_DDR_HW_SELF_REFRESH_MODE:
    return ddr_sr_mode_hsr();
  default:
    return HAL_ERROR;
  }
}

/**
  * @brief  Read current self-refresh mode, in low power
  *         cases (when entering in or exiting from CSTOP).
  * @retval Self-refresh mode.
  */
HAL_DDR_SelfRefreshModeTypeDef HAL_DDR_SR_ReadMode(void)
{
  return ddr_sr_read_mode();
}

/**
  * @}
  */
#endif /* DDRCTRL & DDRPHYC */
#endif /* HAL_DDR_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
